# Origin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleSheetInstance..::..Origin Property
PanelScheduleSheetInstance Class See Also
---
The sheet instance offset in drawing sheet coordinates.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public XYZ Origin { get; set; }
```

Visual Basic
---
```text
Public Property Origin As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace